# Introduction to Python  

## Pandas Intro

Some examples from [here](https://towardsdatascience.com/40-examples-to-master-pandas-c69d058f434e)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
%matplotlib inline

In [2]:
datapath = "../Data/"

## Pandas Data Structures: Series

In [3]:
obj = pd.Series([4, 12, -5, 3, 5])
obj

0     4
1    12
2    -5
3     3
4     5
dtype: int64

In [4]:
obj.values

array([ 4, 12, -5,  3,  5])

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob        4
Steve     12
Jeff      -5
Ryan       3
Fernie     5
dtype: int64

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['c']

3

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2[obj2 < 0]

a   -5
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj3.add(obj4, fill_value=10)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah            5010.0
dtype: float64

In [18]:
obj4.name = 'Population'
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

## Pandas Data Structures: Dataframe

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
d = pd.DataFrame(data, columns=['year', 'state', 'pop'])
d

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [21]:
d.set_index('year', inplace=True)

In [22]:
d.drop(2000, axis=0)

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

In [23]:
d

       state  pop
year
2000    Ohio  1.5
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

In [24]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [25]:
frame2['nova'] = 13
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    13
two    2001    Ohio  1.7  NaN    13
three  2002    Ohio  3.6  NaN    13
four   2001  Nevada  2.4  NaN    13
five   2002  Nevada  2.9  NaN    13

In [26]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
nova       13
Name: three, dtype: object

In [27]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
nova       13
Name: three, dtype: object

In [28]:
frame2.nova = 23
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    23
two    2001    Ohio  1.7  NaN    23
three  2002    Ohio  3.6  NaN    23
four   2001  Nevada  2.4  NaN    23
five   2002  Nevada  2.9  NaN    23

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [30]:
print(frame2['state'])
print()
print(type(frame2['state']))

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

<class 'pandas.core.series.Series'>

In [31]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [32]:
#frame2.loc['three']
frame2.loc['three','state']

'Ohio'

In [33]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5  16.5    23
two    2001    Ohio  1.7  16.5    23
three  2002    Ohio  3.6  16.5    23
four   2001  Nevada  2.4  16.5    23
five   2002  Nevada  2.9  16.5    23

In [34]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   0.0    23
two    2001    Ohio  1.7   1.0    23
three  2002    Ohio  3.6   2.0    23
four   2001  Nevada  2.4   3.0    23
five   2002  Nevada  2.9   4.0    23

In [35]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   NaN    23
two    2001    Ohio  1.7  -1.2    23
three  2002    Ohio  3.6   NaN    23
four   2001  Nevada  2.4  -1.5    23
five   2002  Nevada  2.9  -1.7    23

In [36]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  nova  eastern
one    2000    Ohio  1.5   NaN    23     True
two    2001    Ohio  1.7  -1.2    23     True
three  2002    Ohio  3.6   NaN    23     True
four   2001  Nevada  2.4  -1.5    23    False
five   2002  Nevada  2.9  -1.7    23    False

In [37]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [38]:
pivot = frame2.pivot(index= 'year', columns='state', values='pop') 
pivot

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [39]:
transpose = pivot.T
transpose

year    2000  2001  2002
state
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [42]:
type(pop)

dict

In [43]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [45]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [46]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [47]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [48]:
frame5 = pd.concat([frame4, frame4], axis=0)
frame5.iloc[3,1] = 32
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4  32.0
2002     2.9   3.6
2000     2.0   1.5

In [49]:
frame5.drop_duplicates(['Nevada'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [50]:
dates = pd.date_range("20160101", periods=10, freq='D')
data = np.random.random((10,3))
column_names = ['Column1', 'Column2', 'Column3']

In [51]:
dates

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [52]:
data

array([[0.62913979, 0.79019959, 0.00619003],
       [0.76991954, 0.9532511 , 0.68632449],
       [0.07751208, 0.76736268, 0.34761563],
       [0.55015308, 0.34669569, 0.76271059],
       [0.79435993, 0.40385587, 0.17071117],
       [0.75468257, 0.14059527, 0.20337927],
       [0.27133405, 0.53445474, 0.60641135],
       [0.13431724, 0.17698288, 0.2463155 ],
       [0.8376933 , 0.41480599, 0.98335401],
       [0.76132961, 0.14572454, 0.66264738]])

In [53]:
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.629140  0.790200  0.006190
2016-01-02  0.769920  0.953251  0.686324
2016-01-03  0.077512  0.767363  0.347616
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711
2016-01-06  0.754683  0.140595  0.203379
2016-01-07  0.271334  0.534455  0.606411
2016-01-08  0.134317  0.176983  0.246315
2016-01-09  0.837693  0.414806  0.983354
2016-01-10  0.761330  0.145725  0.662647

In [54]:
df.iloc[0:11,1]

2016-01-01    0.790200
2016-01-02    0.953251
2016-01-03    0.767363
2016-01-04    0.346696
2016-01-05    0.403856
2016-01-06    0.140595
2016-01-07    0.534455
2016-01-08    0.176983
2016-01-09    0.414806
2016-01-10    0.145725
Freq: D, Name: Column2, dtype: float64

In [55]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.769920  0.953251  0.686324
2016-01-03  0.077512  0.767363  0.347616

In [56]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711
2016-01-06  0.754683  0.140595  0.203379
2016-01-07  0.271334  0.534455  0.606411

In [57]:
df[(df.index>'20150101')&(df.index<'20160106')]

             Column1   Column2   Column3
2016-01-01  0.629140  0.790200  0.006190
2016-01-02  0.769920  0.953251  0.686324
2016-01-03  0.077512  0.767363  0.347616
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711

In [58]:
df.query('(Column1 < Column2) & (Column1 < Column3)')

             Column1   Column2   Column3
2016-01-03  0.077512  0.767363  0.347616
2016-01-07  0.271334  0.534455  0.606411
2016-01-08  0.134317  0.176983  0.246315

In [59]:
df.loc['20160101':'20160102',['Column1','Column3']]

            Column1   Column3
2016-01-01  0.62914  0.006190
2016-01-02  0.76992  0.686324

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2016-01-01 to 2016-01-10
Freq: D
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  10 non-null     float64
 1   Column2  10 non-null     float64
 2   Column3  10 non-null     float64
dtypes: float64(3)
memory usage: 640.0 bytes

In [61]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.550153  0.346696
2016-01-05  0.794360  0.403856

In [62]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.558044   0.467393   0.467566
std     0.289963   0.288813   0.314901
min     0.077512   0.140595   0.006190
25%     0.341039   0.219411   0.214113
50%     0.691911   0.409331   0.477013
75%     0.767772   0.709136   0.680405
max     0.837693   0.953251   0.983354

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2016-01-01 to 2016-01-10
Freq: D
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  10 non-null     float64
 1   Column2  10 non-null     float64
 2   Column3  10 non-null     float64
dtypes: float64(3)
memory usage: 640.0 bytes

In [64]:
df.sort_index(axis=0, ascending=True,) # inplace=True)

             Column1   Column2   Column3
2016-01-01  0.629140  0.790200  0.006190
2016-01-02  0.769920  0.953251  0.686324
2016-01-03  0.077512  0.767363  0.347616
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711
2016-01-06  0.754683  0.140595  0.203379
2016-01-07  0.271334  0.534455  0.606411
2016-01-08  0.134317  0.176983  0.246315
2016-01-09  0.837693  0.414806  0.983354
2016-01-10  0.761330  0.145725  0.662647

In [65]:
df[sorted(df.columns)]

             Column1   Column2   Column3
2016-01-01  0.629140  0.790200  0.006190
2016-01-02  0.769920  0.953251  0.686324
2016-01-03  0.077512  0.767363  0.347616
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711
2016-01-06  0.754683  0.140595  0.203379
2016-01-07  0.271334  0.534455  0.606411
2016-01-08  0.134317  0.176983  0.246315
2016-01-09  0.837693  0.414806  0.983354
2016-01-10  0.761330  0.145725  0.662647

In [66]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-06  0.754683  0.140595  0.203379
2016-01-10  0.761330  0.145725  0.662647
2016-01-08  0.134317  0.176983  0.246315
2016-01-04  0.550153  0.346696  0.762711
2016-01-05  0.794360  0.403856  0.170711
2016-01-09  0.837693  0.414806  0.983354
2016-01-07  0.271334  0.534455  0.606411
2016-01-03  0.077512  0.767363  0.347616
2016-01-01  0.629140  0.790200  0.006190
2016-01-02  0.769920  0.953251  0.686324

In [67]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [68]:
df1

             ColumnA   ColumnB
2016-01-01  0.212350  0.777022
2016-01-02  0.432602  0.078207
2016-01-03  0.327123  0.482871
2016-01-04  0.965872  0.805657
2016-01-05  0.642362  0.999015
2016-01-06  0.413546  0.097411

In [69]:
df2

             ColumnC   ColumnD
2016-01-01  0.481442  0.356780
2016-01-02  0.838767  0.944033
2016-01-03  0.618910  0.441341
2016-01-04  0.489115  0.916108
2016-01-05  0.234535  0.728646
2016-01-06  0.645186  0.324465
2016-01-07  0.549100  0.012704

In [70]:
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html
df1.join(df2, how='left')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.212350  0.777022  0.481442  0.356780
2016-01-02  0.432602  0.078207  0.838767  0.944033
2016-01-03  0.327123  0.482871  0.618910  0.441341
2016-01-04  0.965872  0.805657  0.489115  0.916108
2016-01-05  0.642362  0.999015  0.234535  0.728646
2016-01-06  0.413546  0.097411  0.645186  0.324465

In [71]:
df1.join(df2, how='right')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.212350  0.777022  0.481442  0.356780
2016-01-02  0.432602  0.078207  0.838767  0.944033
2016-01-03  0.327123  0.482871  0.618910  0.441341
2016-01-04  0.965872  0.805657  0.489115  0.916108
2016-01-05  0.642362  0.999015  0.234535  0.728646
2016-01-06  0.413546  0.097411  0.645186  0.324465
2016-01-07       NaN       NaN  0.549100  0.012704

In [72]:
df1.join(df2, how='outer')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.212350  0.777022  0.481442  0.356780
2016-01-02  0.432602  0.078207  0.838767  0.944033
2016-01-03  0.327123  0.482871  0.618910  0.441341
2016-01-04  0.965872  0.805657  0.489115  0.916108
2016-01-05  0.642362  0.999015  0.234535  0.728646
2016-01-06  0.413546  0.097411  0.645186  0.324465
2016-01-07       NaN       NaN  0.549100  0.012704

In [73]:
df1.join(df2, how='inner')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.212350  0.777022  0.481442  0.356780
2016-01-02  0.432602  0.078207  0.838767  0.944033
2016-01-03  0.327123  0.482871  0.618910  0.441341
2016-01-04  0.965872  0.805657  0.489115  0.916108
2016-01-05  0.642362  0.999015  0.234535  0.728646
2016-01-06  0.413546  0.097411  0.645186  0.324465

In [74]:
df2['ColumnA'] = df1.ColumnA+1
df1.join(df2, how='left', rsuffix='_df2')

             ColumnA   ColumnB   ColumnC   ColumnD  ColumnA_df2
2016-01-01  0.212350  0.777022  0.481442  0.356780     1.212350
2016-01-02  0.432602  0.078207  0.838767  0.944033     1.432602
2016-01-03  0.327123  0.482871  0.618910  0.441341     1.327123
2016-01-04  0.965872  0.805657  0.489115  0.916108     1.965872
2016-01-05  0.642362  0.999015  0.234535  0.728646     1.642362
2016-01-06  0.413546  0.097411  0.645186  0.324465     1.413546

In [75]:
del df2['ColumnA']
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Same', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Same', 
                               'Loss'], index=dates)

In [76]:
df3['Student'] = pd.Series(['Alex',
                            'Alex',
                            'Alex',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Barbara'], index=dates)

In [77]:
df3

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss Student
2016-01-01  0.212350  0.777022  0.481442  0.356780     Profit    Alex
2016-01-02  0.432602  0.078207  0.838767  0.944033       Loss    Alex
2016-01-03  0.327123  0.482871  0.618910  0.441341     Profit    Alex
2016-01-04  0.965872  0.805657  0.489115  0.916108       Same  Marcos
2016-01-05  0.642362  0.999015  0.234535  0.728646     Profit  Hannah
2016-01-06  0.413546  0.097411  0.645186  0.324465       Loss  Hannah

In [78]:
grupos = df3.groupby('ProfitLoss')#.mean()
grupos.mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.423074  0.087809  0.741976  0.634249
Profit      0.393945  0.752969  0.444962  0.508922
Same        0.965872  0.805657  0.489115  0.916108

Verifying Python's ordering heuristics

In [79]:
max(['name1', 'name2', 'Name3'])

'name2'

In [80]:
df4 = df3.groupby(['Student','ProfitLoss']).max()
df4

                     ColumnA   ColumnB   ColumnC   ColumnD
Student ProfitLoss
Alex    Loss        0.432602  0.078207  0.838767  0.944033
        Profit      0.327123  0.777022  0.618910  0.441341
Hannah  Loss        0.413546  0.097411  0.645186  0.324465
        Profit      0.642362  0.999015  0.234535  0.728646
Marcos  Same        0.965872  0.805657  0.489115  0.916108

In [81]:
df4.index.get_level_values('Student')

Index(['Alex', 'Alex', 'Hannah', 'Hannah', 'Marcos'], dtype='object', name='Student')

In [82]:
df4.loc[('Hannah','Profit'), 'ColumnA']

0.6423620225010472

### [Pandas Useful Functions](https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html)

#### [idmin & idmax](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.idxmax.html)

In [83]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-04 00:00:00', freq='D')

In [84]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-01 00:00:00', freq='D')

#### [Not Equal - ne()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.ne.html)  
#### nsmallest()  
#### nlargest()  
#### isin()

In [85]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]
df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [86]:
df['x'].ne(0).idxmax()

6

In [87]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [88]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

In [103]:
df.isin([0,2]).head()

      x
0  True
1  True
2  True
3  True
4  True

In [108]:
df[~df.isin([0,2])].dropna()

      x
6   1.0
8   3.0
9   4.0
10  5.0
11  6.0
12  7.0

#### [Pandas.melt()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.melt.html)

In [90]:
# Create a test dataframe
# Untidy dataframe
# x : Subjects
# y : Student names

marks = pd.DataFrame(np.random.randint(0, 100, size = (30,5)), 
                     columns = ['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science'])

In [91]:
# Add student column to dataset
marks['Student'] = ['Student ' + str(i) for i in range(1,31)]
display(marks.head())

   Maths  Physics  Chemistry  Biology  Computer_Science    Student
0     94       45         46       98                76  Student 1
1     14       60         88       36                72  Student 2
2     36       65         35       22                27  Student 3
3     33       84         67       98                79  Student 4
4      0       19         80       32                16  Student 5

In [92]:
# Bring last column to first position
cols = marks.columns.tolist()
marks = marks[['Student','Chemistry', 'Biology', 'Computer_Science', 'Maths', 'Physics']]

In [93]:
marks.head(10)

      Student  Chemistry  Biology  Computer_Science  Maths  Physics
0   Student 1         46       98                76     94       45
1   Student 2         88       36                72     14       60
2   Student 3         35       22                27     36       65
3   Student 4         67       98                79     33       84
4   Student 5         80       32                16      0       19
5   Student 6         42       11                85      7       26
6   Student 7          0       86                53     27       15
7   Student 8         90       14                71     84       78
8   Student 9         76       46                83     88       41
9  Student 10         58       32                19     66       64

In [94]:
tidy = pd.melt(marks,
               id_vars = 'Student',
               value_name = 'Frequency')
tidy.head(10)

      Student   variable  Frequency
0   Student 1  Chemistry         46
1   Student 2  Chemistry         88
2   Student 3  Chemistry         35
3   Student 4  Chemistry         67
4   Student 5  Chemistry         80
5   Student 6  Chemistry         42
6   Student 7  Chemistry          0
7   Student 8  Chemistry         90
8   Student 9  Chemistry         76
9  Student 10  Chemistry         58

#### Applying Pandas Operations in Parallel

In [95]:
!pip install -U -q pandarallel aiomultiprocess

  WARNING: Building wheel for pandarallel failed: [Errno 13] Permissão negada: '/home/rsouza/.cache/pip/wheels/fb/b8'
  DEPRECATION: pandarallel was installed using the legacy 'setup.py install' method, because a wheel could not be built for it. pip 21.0 will remove support for this functionality. A possible replacement is to fix the wheel build issue reported above. You can find discussion regarding this at https://github.com/pypa/pip/issues/8368.
WARNING: You are using pip version 20.2.4; however, version 20.3.3 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.

In [96]:
#from pandarallel import pandarallel
#from tqdm._tqdm_notebook import tqdm_notebook
#tqdm_notebook.pandas()

In [97]:
#pandarallel.initialize(progress_bar=True)

In [98]:
#df = pd.DataFrame({
#    'A' : [random.randint(15,20) for i in range(1,1000000) ],
#    'B' : [random.randint(10,30) for i in range(1,1000000) ]
#})

In [99]:
#def func(x):
#    return math.sin(x.A**2) + math.sin(x.B**2) + math.tan(x.A**2)

WITHOUT PARALLELIZATION

In [100]:
#%%time
#res = df.progress_apply(func, axis=1)

WITH PARALLELIZATION

In [101]:
#%%time
#res_parallel = df.parallel_apply(func, axis=1)